title: AWS Console Login Without MFA
id: a1b2c3d4-0001-0001-0001-000000000001
status: stable
description: >
  Detects a succesful AWS Console login without MFA.
author: bc-security-team
date: 2026/04/17
tags:
  - attack.initial_access
  - attack.t1078
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventSource: signin.amazonaws.com
    eventName: ConsoleLogin
    responseElements.ConsoleLogin: Success
    additionalEventData.MFAUsed: "No"
  condition: selection
falsepositives:
  - Break-glass root accounts (Add to suppression list)
level: high
